Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.SetTemporaryState Method (List<Identifier>, Color)
 Sets visualization temporary state (red, blue, green and transparency) for given model object identifiers
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SetTemporaryState(
	List<Identifier> identifiers,
	Color color
)
Public Shared Function SetTemporaryState (
	identifiers As List(Of Identifier),
	color As Color
) As Boolean
Parameters
identifiers
Type: System.Collections.Generic.List<Identifier>
The list of model object identifiers.
color
Type: Tekla.Structures.Model.UI.Color
The temporary color for given model objects.
Return Value
Type: Boolean
True if the temporary state could be set.
See Also
Reference
ModelObjectVisualization Class
SetTemporaryState Overload
Tekla.Structures.Model.UI Namespace